Revit.Elements.Form.#ctor(Autodesk.Revit.DB.Form)
Construct a Revit Form from an existing form.
form:

Revit.Elements.Form.#ctor(System.Boolean,Autodesk.Revit.DB.ReferenceArrayArray)
Create a Form by lofting
isSolid:
curves:

Revit.Elements.Form.InitForm(Autodesk.Revit.DB.Form)
Initialize a form element
form:

Revit.Elements.Form.InitForm(System.Boolean,Autodesk.Revit.DB.ReferenceArrayArray)
Initialize a form element
isSolid:
curves:

Revit.Elements.Form.ByLoftCrossSections(Autodesk.DesignScript.Geometry.Curve[],System.Boolean)
Creates a Form by lofting a list of curves
curves:
isSolid:
Returns:

Revit.Elements.Form.ByLoftCrossSections(Autodesk.DesignScript.Geometry.Curve[][],System.Boolean)
Creates a Form by lofting a nested list of curves
curves:
isSolid:
Returns:

Revit.Elements.Form.FromExisting(Autodesk.Revit.DB.Form,System.Boolean)
Construct the Revit element by selection.
formElement:
isRevitOwned:
Returns:

Revit.Elements.Form.InternalElement
Reference to the Element